/** @jsx h */
import { h } from 'hyperapp';
import { Articles } from '../Article';

// TODO: Move to Firestore
const talks = [
  {
    url: 'https://dev.bg/събитие/как-да-оценяваме-времето-и-труда-си-кат',
    title: '[BG] DEV.BG: Как да оценяваме времето и труда си като фрийлансъри',
    description: `- Защо да изберем свободна професия
- Как да се изправим срещу предизвикателствата
- Как да оценяваме времето и труда си
- Разработване и доставяне на продукта
- Равносметката след като сме постигнали целите си`,
    date: '2017-07-24T16:30:00.000Z'
  },

  {
    url: 'https://dev.bg/събитие/it-freelance-изготвяне-на-оферта-от-0-до-100/',
    title: '[BG] DEV.BG: Изготвяне на оферта от 0 до 100%',
    description: `- Предимства на детайлната оферта
- Проучване на нуждите на клиента
- Определяне и оценяване на функционални модули
- Оформяне на документа
- Урокът, скрит във всяка оферта`,
    date: '2017-10-23T16:30:00.000Z'
  }
];

export const Talks = Articles(talks);
